# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
# 5
#     1 2 3 4 5
#     3
#     -> 1

N = int(input('Введите количество элементов списка: '))
list = [int(input('Введите число списка: ')) for i in range(1, N+1)]
print(list)
X = int(input('Введите число которое необходимо найти: '))
print(sum([list[i] == X for i in range(len(list))]))